pragtips/app/controllers/tips_controller.rb

SELECT * FROM "tips"
---
  def index
    @tips = Tip.all

SELECT * FROM "tips" WHERE ("tips"."id" = 1)
---
  def show
    @tip = Tip.find(params[:id])

SELECT * FROM "tips" WHERE ("tips"."id" = 43)
---
  def edit
    @tip = Tip.find(params[:id])

INSERT INTO "tips" ("updated_at", "title", "description", "book", "created_at") VALUES('2009-11-24 14:18:01', 'Care About Your Craft', 'Why spend your life developing software unless you care about doing it well?', 'The Pragmatic Programmer', '2009-11-24 14:18:01')
---
  def create
    @tip = Tip.new(params[:tip])

    respond_to do |format|
      if @tip.save

SELECT * FROM "tips" WHERE ("tips"."id" = 43)
UPDATE "tips" SET "book" = 'The Pragmatic Programmer', "updated_at" = '2009-11-24 14:45:10' WHERE "id" = 43
---
  def update
    @tip = Tip.find(params[:id])

    respond_to do |format|
      if @tip.update_attributes(params[:tip])